[
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Sistema de numeração decimal: leitura, escrita\ne ordenação de números naturais (de até seis\nordens)",
    "codigo_bncc": "EF05MA01",
    "habilidade_bncc": " Ler, escrever e ordenar números naturais até a ordem das centenas de milhar com compreensão das principais características do sistema de numeração decimal. "
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Números racionais expressos na forma decimal e sua representação na reta numérica",
    "codigo_bncc": "EF05MA02",
    "habilidade_bncc": "Ler, escrever e ordenar números racionais na forma decimal com compreensão das principais características do sistema de numeração decimal, utilizando, como recursos, a composição e decomposição e a reta numérica."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Representação fracionária dos números racionais: reconhecimento, significados, leitura e\nrepresentação na reta numérica",
    "codigo_bncc": "EF05MA03",
    "habilidade_bncc": " Identificar e representar frações (menores e maiores que a unidade), associando-as ao resultado de uma divisão ou à ideia de parte de um todo, utilizando a reta numérica como recurso."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Comparação e ordenação de números racionais\nna representação decimal e na fracionária\nutilizando a noção de equivalência",
    "codigo_bncc": "EF05MA04",
    "habilidade_bncc": "Identificar frações equivalentes."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Comparação e ordenação de números racionais\nna representação decimal e na fracionária\nutilizando a noção de equivalência",
    "codigo_bncc": "EF05MA05",
    "habilidade_bncc": "Comparar e ordenar números racionais positivos (representações fracionária e decimal), relacionando-os a pontos na reta numérica."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Cálculo de porcentagens e representação fracionária ",
    "codigo_bncc": "EF05MA06",
    "habilidade_bncc": "Associar as representações 10%, 25%, 50%, 75% e 100% respectivamente à décima parte, quarta parte, metade, três quartos e um inteiro, para calcular porcentagens, utilizando estratégias pessoais, cálculo mental e calculadora, em contextos de educação financeira, entre outros."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Problemas: adição e subtração de números\nnaturais e números racionais cuja representação\ndecimal é finita",
    "codigo_bncc": "EF05MA07",
    "habilidade_bncc": "Resolver e elaborar problemas de adição e subtração com números naturais e com números racionais, cuja representação decimal seja finita, utilizando estratégias diversas, como cálculo por estimativa, cálculo mental e algoritmos."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Problemas: multiplicação e divisão de números racionais cuja representação decimal é finita por números naturais",
    "codigo_bncc": "EF05MA08",
    "habilidade_bncc": "Resolver e elaborar problemas de multiplicação e divisão com números naturais e com números racionais cuja representação decimal é finita (com multiplicador natural e divisor natural e diferente de zero), utilizando estratégias diversas, como cálculo por estimativa, cálculo mental e algoritmos."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Números",
    "objetos_de_conhecimento": "Problemas de contagem do tipo: “Se cada objeto de uma coleção A for combinado com todos os elementos de uma coleção B, quantos agrupamentos desse tipo podem ser formados?”",
    "codigo_bncc": "EF05MA09",
    "habilidade_bncc": "Resolver e elaborar problemas simples de contagem envolvendo o princípio multiplicativo, como a determinação do número de agrupamentos possíveis ao se combinar\ncada elemento de uma coleção com todos os elementos de outra coleção, por meio de diagramas de árvore ou por tabelas."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Álgebra",
    "objetos_de_conhecimento": "Propriedades da igualdade e noção de equivalência",
    "codigo_bncc": "EF05MA10",
    "habilidade_bncc": "Concluir, por meio de investigações, que a relação de igualdade existente entre dois membros permanece ao adicionar, subtrair, multiplicar ou dividir cada um desses membros por um mesmo número, para construir a noção de equivalência."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Álgebra",
    "objetos_de_conhecimento": "Propriedades da igualdade e noção de equivalência",
    "codigo_bncc": "EF05MA11",
    "habilidade_bncc": "Resolver e elaborar problemas cuja conversão em sentença matemática seja uma igualdade com uma operação em que um dos termos é desconhecido."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Álgebra",
    "objetos_de_conhecimento": "Grandezas diretamente proporcionais\n",
    "codigo_bncc": "EF05MA12",
    "habilidade_bncc": "Resolver problemas que envolvam variação de proporcionalidade direta entre duas grandezas, para associar a quantidade de um produto ao valor a pagar, alterar as quantidades de ingredientes de receitas, ampliar ou reduzir escala em mapas, entre outros."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Álgebra",
    "objetos_de_conhecimento": "Problemas envolvendo a partição de um todo em duas partes proporcionais",
    "codigo_bncc": "EF05MA13",
    "habilidade_bncc": " Resolver problemas envolvendo a partilha de uma quantidade em duas partes desiguais, tais como dividir uma quantidade em duas partes, de modo que uma seja o dobro da outra, com compreensão da ideia de razão entre as partes e delas com o todo."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Geometria",
    "objetos_de_conhecimento": "Plano cartesiano: coordenadas cartesianas (1º quadrante) e representação de deslocamentos no plano cartesiano ",
    "codigo_bncc": "EF05MA14",
    "habilidade_bncc": " Utilizar e compreender diferentes representações para a localização de objetos no plano, como mapas, células em planilhas eletrônicas e coordenadas geográficas, a fim de desenvolver as primeiras noções de coordenadas cartesianas."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Geometria",
    "objetos_de_conhecimento": "Plano cartesiano: coordenadas cartesianas (1º quadrante) e representação de deslocamentos no plano cartesiano ",
    "codigo_bncc": "EF05MA15",
    "habilidade_bncc": "Interpretar, descrever e representar a localização ou movimentação de objetos no plano cartesiano (1º quadrante), utilizando coordenadas cartesianas, indicando mudanças de direção e de sentido e giros."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Geometria",
    "objetos_de_conhecimento": "Figuras geométricas espaciais: reconhecimento,\nrepresentações, planificações e características",
    "codigo_bncc": "EF05MA16",
    "habilidade_bncc": "Associar figuras espaciais a suas planificações (prismas, pirâmides, cilindros e cones) e analisar, nomear e comparar seus atributos."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Geometria",
    "objetos_de_conhecimento": "Figuras geométricas planas: características,\nrepresentações e ângulos",
    "codigo_bncc": "EF05MA17",
    "habilidade_bncc": "Reconhecer, nomear e comparar polígonos, considerando lados, vértices e ângulos, e desenhá-los, utilizando material de desenho ou tecnologias digitais. "
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Geometria",
    "objetos_de_conhecimento": "Ampliação e redução de figuras poligonais\nem malhas quadriculadas: reconhecimento da\ncongruência dos ângulos e da proporcionalidade\ndos lados correspondentes",
    "codigo_bncc": "EF05MA18",
    "habilidade_bncc": " Reconhecer a congruência dos ângulos e a proporcionalidade entre os lados correspondentes de figuras poligonais em situações de ampliação e de redução em malhas\nquadriculadas e usando tecnologias digitais."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Grandezas e medidas",
    "objetos_de_conhecimento": "Medidas de comprimento, área, massa, tempo, temperatura e capacidade: utilização de unidades convencionais e relações entre as unidades de medida mais usuais",
    "codigo_bncc": "EF05MA19",
    "habilidade_bncc": "Resolver e elaborar problemas envolvendo medidas das grandezas comprimento, área, massa, tempo, temperatura e capacidade, recorrendo a transformações entre as unidades\nmais usuais em contextos socioculturais. "
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Grandezas e medidas",
    "objetos_de_conhecimento": "Áreas e perímetros de figuras poligonais:\nalgumas relações",
    "codigo_bncc": "EF05MA20",
    "habilidade_bncc": "Concluir, por meio de investigações, que figuras de perímetros iguais podem ter áreas diferentes e que, também, figuras que têm a mesma área podem ter perímetros diferentes."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Grandezas e medidas",
    "objetos_de_conhecimento": "Noção de volume",
    "codigo_bncc": "EF05MA21",
    "habilidade_bncc": "Reconhecer volume como grandeza associada a sólidos geométricos e medir volumes por meio de empilhamento de cubos, utilizando, preferencialmente, objetos concretos."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Probabilidade e Estatística",
    "objetos_de_conhecimento": "Espaço amostral: análise de chances de eventos\naleatórios",
    "codigo_bncc": "EF05MA22",
    "habilidade_bncc": "Apresentar todos os possíveis resultados de um experimento aleatório, estimando se esses resultados são igualmente prováveis ou não."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Probabilidade e Estatística",
    "objetos_de_conhecimento": "Cálculo de probabilidade de eventos equiprováveis",
    "codigo_bncc": "EF05MA23",
    "habilidade_bncc": "Determinar a probabilidade de ocorrência de um resultado em eventos aleatórios, quando todos os resultados possíveis têm a mesma chance de ocorrer (equiprováveis)."
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Probabilidade e Estatística",
    "objetos_de_conhecimento": "Leitura, coleta, classificação interpretação e representação de dados em tabelas de dupla entrada, gráfico de colunas agrupadas, gráficos pictóricos e gráfico de linhas",
    "codigo_bncc": "EF05MA24",
    "habilidade_bncc": " Interpretar dados estatísticos apresentados em textos, tabelas e gráficos (colunas ou linhas), referentes a outras áreas do conhecimento ou a outros contextos, como saúde e trânsito, e produzir textos com o objetivo de sintetizar conclusões. "
  },
  {
    "componente": "Matemática",
    "ano": "5º",
    "unidades_tematicas": "Probabilidade e Estatística",
    "objetos_de_conhecimento": "Leitura, coleta, classificação interpretação e representação de dados em tabelas de dupla entrada, gráfico de colunas agrupadas, gráficos pictóricos e gráfico de linhas",
    "codigo_bncc": "EF05MA25",
    "habilidade_bncc": "Realizar pesquisa envolvendo variáveis categóricas e numéricas, organizar dados\ncoletados por meio de tabelas, gráficos de colunas, pictóricos e de linhas, com e sem uso de\ntecnologias digitais, e apresentar texto escrito sobre a finalidade da pesquisa e a síntese dos\nresultados."
  }
]